In [3]:
import pandas as pd

In [4]:
books= {
    'title' : ['Great Expectation','To Kill a Mockingbird','Pride and Prejudice','the book theif','1984',],
    'author' :['charles dickens','harper lee','Jane austen','Markus Zusak','George Orwell'],
    'pages' :[544,281,432,552,328],
    'price':[10.99,6.99,5.99,7.99,9.99]
}
pd.DataFrame(books)

                   title           author  pages  price
0      Great Expectation  charles dickens    544  10.99
1  To Kill a Mockingbird       harper lee    281   6.99
2    Pride and Prejudice      Jane austen    432   5.99
3         the book theif     Markus Zusak    552   7.99
4                   1984    George Orwell    328   9.99

In [5]:
movies=[
    {'title':'avengers','director': 'jos whedon','year':2012},
    {'title': 'PK','director':'rajkumar hirani','year': 2014},
    {'title': '3 ideots','director':'rajkumar hirani','year': 2009},
    {'title': 'dangal','director':'Nitesh tiware','year': 2016},
    {'title': 'sultan','director':'rajkumar hirani','year': 2018}
]
pd.DataFrame(movies)

      title         director  year
0  avengers       jos whedon  2012
1        PK  rajkumar hirani  2014
2  3 ideots  rajkumar hirani  2009
3    dangal    Nitesh tiware  2016
4    sultan  rajkumar hirani  2018

In [ ]:
df

In [6]:
# print first 5 row by default
df.tail(10)

NameError: name 'df' is not defined

In [ ]:
# print first 5 row by default
df.head(10)

In [ ]:
# print random 5 rows
df.sample(5)

In [ ]:
df.info()

In [ ]:
# print the statistics of the dataframe
df.describe

In [ ]:
df.describe(include='object')

In [ ]:
df.shape

Selecting data in pandas

- iloc - index based location
- loc - label based location

#select row of 100th indexing postion
df.iloc[100]

In [ ]:
#select rows of 1st, 59th, 100th, 200th, 300th indexing postion
df.iloc[[1,59,100,200,300]]

In [ ]:
#select 1st, 10th, 20th row and 0th ,11th,12th,13th,14th column
df.iloc[[1,10,20],[0,11,12,13,14]]

In [ ]:
df.iloc[10:51,:10]

In [ ]:
df = df.set_index('id')
df.head()

In [ ]:
df.loc[7129300520,6414100192,5631500400]

### single column selection
Dictionary like selection 
   - dataframe['column_name']

   object like selection 
     - dataframe['column_name']

### Multiple column selection
dictionary like selection
   - dataframe[[list_of_columns_name]]

In [ ]:
print(df.columns.tolist())

In [ ]:
df.columns

In [ ]:
df['price']

In [ ]:
df.bedrooms

In [ ]:
df[['price','badrooms','bathrooms']]

NameError: name 'df' is not defined

Manipulation and Cleaning Data
- rempoving raw columns and rows
- renaming column names
- adding columns
- changing datatypes
- handling missing values
- dropping missing values 
- using apply() method

In [ ]:
df.columns

NameError: name 'df' is not defined

In [7]:
cols_to_drop=['sqft_living15','sqft_lot15']
df= df.drop(columns=cols_to_drop)
df

NameError: name 'df' is not defined

In [ ]:
df = df.drop(labels=[263000018,7129300520])
df

In [ ]:
df.info()

In [ ]:
df.dropna()#drop rows with missing values

In [ ]:
# to rename the columns
name_update ={
    'lat':'latirtude',
    'long':'longitude'
}
df = df.rename(columns=name_update)
df

In [1]:
df.yr_built.dtype

NameError: name 'df' is not defined

In [ ]:
df.yr_built.astype('float')# datatype changing

In [2]:
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
avg_age = round(df['age'].mean())
print(avg_age)

30

In [8]:
df['age'].fillna(avg_age, inplace= True)
df

C:\Users\ARYAN\AppData\Local\Temp\ipykernel_20388\3092809335.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(avg_age, inplace= True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,30.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [10]:
df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [12]:
df['embark_town'].value_counts().idxmax()

'Southampton'

In [13]:
df['embark_town'].value_counts().idxmin()

'Queenstown'